export interface HistoryEndpoint {
	id: number;
	label: string;
	dates: number[];
	events: Event[];
}

export interface Event {
	year: number;
	desc: string;
}

export const historyEndpoints: HistoryEndpoint[] = [
	{
		id: 1,
		label: 'История',
		dates: [1986, 1991],
		events: [
			{ year: 1986, desc: 'Принятие новой конституции' },
			{ year: 1987, desc: 'Мирное соглашение' },
			{ year: 1988, desc: 'Революционные протесты' },
			{ year: 1989, desc: 'Значимое политическое событие' },
			{ year: 1990, desc: 'Принятие новой конституции' },
			{ year: 1991, desc: 'Переименование города' },
		],
	},
	{
		id: 2,
		label: 'Наука',
		dates: [2000, 2005],
		events: [
			{ year: 2000, desc: 'Разработка вакцины' },
			{ year: 2001, desc: 'Разработка новой теории в астрофизике' },
			{ year: 2002, desc: 'Открытие экзопланеты' },
			{ year: 2003, desc: 'Открытие экзопланеты' },
			{ year: 2004, desc: 'Разработка вакцины' },
			{ year: 2005, desc: 'Разработка вакцины' },
		],
	},
	{
		id: 3,
		label: 'Образование',
		dates: [2006, 2010],
		events: [
			{ year: 2006, desc: 'Открытие университетского кампуса' },
			{ year: 2007, desc: 'Внедрение цифровых технологий в обучение' },
			{ year: 2008, desc: 'Внедрение цифровых технологий в обучение' },
			{ year: 2009, desc: 'Запуск нового образовательного онлайн-курса' },
			{ year: 2010, desc: 'Расширение международных обменов' },
		],
	},
	{
		id: 4,
		label: 'Культура',
		dates: [2011, 2015],
		events: [
			{ year: 2011, desc: 'Проведение международного фестиваля' },
			{ year: 2012, desc: 'Выход популярного фильма' },
			{ year: 2013, desc: 'Создание новой культурной инициативы' },
			{ year: 2014, desc: 'Создание новой культурной инициативы' },
			{ year: 2015, desc: 'Создание новой культурной инициативы' },
		],
	},
	{
		id: 5,
		label: 'Технологии',
		dates: [2016, 2020],
		events: [
			{ year: 2010, desc: 'Выход новой версии ОС' },
			{ year: 2011, desc: 'Интеграция 5G-сетей' },
			{ year: 2012, desc: 'Прорыв в области искусственного интеллекта' },
			{ year: 2013, desc: 'Разработка квантового компьютера' },
			{ year: 2014, desc: 'Выход новой версии ОС' },
			{ year: 2015, desc: 'Создание автономного транспорта' },
		],
	},
	{
		id: 6,
		label: 'Экономика',
		dates: [2021, 2025],
		events: [
			{ year: 2021, desc: 'Принятие нового налогового законодательства' },
			{ year: 2022, desc: 'Кризис на валютном рынке' },
			{ year: 2023, desc: 'Кризис на валютном рынке' },
			{ year: 2024, desc: 'Экономическая реформа' },
			{ year: 2025, desc: 'Кризис на валютном рынке' },
		],
	},
];
